Experiment 1. Experiment with following pandas operation through python commands

1.1 Introduction to pandas

In [ ]:
# import pandas as pd
import pandas as pd

# simple array
data = [1, 2, 3, 4]

ser = pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
import pandas as pd
import numpy as np
# simple array
data = np.array(['g', 'e', 'e', 'k', 's'])
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [ ]:
import pandas as pd

list = ['g', 'e', 'e', 'k', 's']

# create series form a list
ser = pd.Series(list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [ ]:
import pandas as pd
import numpy as np

data = np.array(['g', 'e', 'e', 'k', 's'])
ser = pd.Series(data, index =[10, 11, 12, 13, 14])
print(ser)

10    g
11    e
12    e
13    k
14    s
dtype: object

Creating a pandas dataframe

In [ ]:
import pandas as pd

#calling dataframe constructor
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
import pandas as pd

data = {'Name':['Tom', 'Nick', 'Krish', 'Jack'], 'Age':[20, 21, 19, 18]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   20
1   Nick   21
2  Krish   19
3   Jack   18

In [ ]:
import pandas as pd
dict = {'Name':["Aparna", "Pankaj", "sudhir", "Geeku"],
		'Degree': ["MBA", "BCA", "M.Tech", "MBA"],
		'Score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
print(df)

     Name  Degree  Score
0  Aparna     MBA     90
1  Pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

1.2 Data Selection and Indexing

In [ ]:
import pandas as pd

dict = {'Name':["Aparna", "Pankaj", "sudhir", "Geeku"],
		'Degree': ["MBA", "BCA", "M.Tech", "MBA"],
		'Score':[90, 40, 80, 98]}
d=pd.DataFrame(dict)
print(d.head())

     Name  Degree  Score
0  Aparna     MBA     90
1  Pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [ ]:
print(d.tail(3))

     Name  Degree  Score
1  Pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [ ]:
print(d.loc[1])

Name      Pankaj
Degree       BCA
Score         40
Name: 1, dtype: object

In [ ]:
print(d.loc[:, ["Name","Score"]])

     Name  Score
0  Aparna     90
1  Pankaj     40
2  sudhir     80
3   Geeku     98

In [ ]:
print(d.iloc[2])

Name      sudhir
Degree    M.Tech
Score         80
Name: 2, dtype: object

In [ ]:
print(d.iloc[:,2])

0    90
1    40
2    80
3    98
Name: Score, dtype: int64

1.3 Data Cleaning and Preprocessing

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', None, 'Eve'],
    'Age': [25, None, 30, 22, None],
    'City': ['New York', None, 'San Francisco', 'Los Angeles', 'Austin']
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
      Name   Age           City
0    Alice  25.0       New York
1      Bob   NaN           None
2  Charlie  30.0  San Francisco
3     None  22.0    Los Angeles
4      Eve   NaN         Austin

Pandas has a method .isna() (or .isnull()) to detect missing values.

In [ ]:
print("\nIdentifying missing values:")
print(df.isna())

Identifying missing values:
    Name    Age   City
0  False  False  False
1  False   True   True
2  False  False  False
3   True  False  False
4  False   True  False

You can use the .fillna() method to fill missing values with a specific value (like 0, a string, or the mean, etc.).

In [ ]:
df_filled = df.fillna({'Age': 28, 'City': 'Unknown'})
print("\nDataFrame after filling missing values:")
print(df_filled)
df['Age'] = df['Age'].fillna(df['Age'].mean())
print("\nDataFrame after filling Age with the mean value:")
print(df)

DataFrame after filling missing values:
      Name   Age           City
0    Alice  25.0       New York
1      Bob  28.0        Unknown
2  Charlie  30.0  San Francisco
3     None  22.0    Los Angeles
4      Eve  28.0         Austin

DataFrame after filling Age with the mean value:
      Name        Age           City
0    Alice  25.000000       New York
1      Bob  25.666667           None
2  Charlie  30.000000  San Francisco
3     None  22.000000    Los Angeles
4      Eve  25.666667         Austin

Forward fill (fill with previous value):

In [ ]:
df_ffill = df.fillna(method='ffill')
print("\nDataFrame after forward filling missing values:")
print(df_ffill)

DataFrame after forward filling missing values:
      Name        Age           City
0    Alice  25.000000       New York
1      Bob  25.666667       New York
2  Charlie  30.000000  San Francisco
3  Charlie  22.000000    Los Angeles
4      Eve  25.666667         Austin

<ipython-input-50-718b3aea65cd>:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_ffill = df.fillna(method='ffill')

Backward fill (fill with next value):

In [ ]:
df_bfill = df.fillna(method='bfill')
print("\nDataFrame after backward filling missing values:")
print(df_bfill)

DataFrame after backward filling missing values:
      Name        Age           City
0    Alice  25.000000       New York
1      Bob  25.666667  San Francisco
2  Charlie  30.000000  San Francisco
3      Eve  22.000000    Los Angeles
4      Eve  25.666667         Austin

<ipython-input-51-9fc58df5e6a9>:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_bfill = df.fillna(method='bfill')

Dropping Rows with Missing Values:
You can use .dropna() to drop rows that contain missing values.

Drop rows with any missing values:

In [ ]:
df_dropped = df.dropna()
print("\nDataFrame after dropping rows with any missing values:")
print(df_dropped)

DataFrame after dropping rows with any missing values:
      Name        Age           City
0    Alice  25.000000       New York
2  Charlie  30.000000  San Francisco
4      Eve  25.666667         Austin

Drop rows where a specific column has missing values:

In [ ]:
df_dropped_column = df.dropna(subset=['Age'])
print("\nDataFrame after dropping rows where 'Age' is missing:")
print(df_dropped_column)

DataFrame after dropping rows where 'Age' is missing:
      Name        Age           City
0    Alice  25.000000       New York
1      Bob  25.666667           None
2  Charlie  30.000000  San Francisco
3     None  22.000000    Los Angeles
4      Eve  25.666667         Austin

 Checking for Missing Values:

In [ ]:
print("\nCheck for any missing values:")
print(df.isna().any())

Check for any missing values:
Name     True
Age     False
City     True
dtype: bool

1.4 Aggregation and Grouping

In [ ]:
import pandas as pd
data = {
    'Product': ['A', 'B', 'A', 'B', 'C', 'A', 'C'],
    'Region': ['East', 'West', 'East', 'West', 'East', 'West', 'East'],
    'Salesperson': ['John', 'Paul', 'John', 'Paul', 'George', 'Ringo', 'George'],
    'Sales': [250, 300, 150, 200, 450, 500, 550]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

Original DataFrame:
  Product Region Salesperson  Sales
0       A   East        John    250
1       B   West        Paul    300
2       A   East        John    150
3       B   West        Paul    200
4       C   East      George    450
5       A   West       Ringo    500
6       C   East      George    550

Aggregation
1. Grouping Data and Aggregating:
You can use the .groupby() method to group data based on one or more columns, and then apply aggregation functions such as sum(), mean(), count(), min(), max(), etc.

Group by Product and calculate the total Sales per product:

In [ ]:
grouped_product_sales = df.groupby('Product')['Sales'].sum()
print("\nTotal Sales per Product:")
print(grouped_product_sales)

Total Sales per Product:
Product
A     900
B     500
C    1000
Name: Sales, dtype: int64

Group by Region and Salesperson, then calculate the average Sales:

In [ ]:
grouped_region_sales = df.groupby(['Region', 'Salesperson'])['Sales'].mean()
print("\nAverage Sales by Region and Salesperson:")
print(grouped_region_sales)

Average Sales by Region and Salesperson:
Region  Salesperson
East    George         500.0
        John           200.0
West    Paul           250.0
        Ringo          500.0
Name: Sales, dtype: float64

Multiple Aggregation Functions:
You can apply multiple aggregation functions to one or more columns at the same time using .agg().

In [ ]:
aggregated_sales = df.groupby('Product')['Sales'].agg(['sum', 'mean', 'max'])
print("\nSales Aggregation (sum, mean, max) per Product:")
print(aggregated_sales)

Sales Aggregation (sum, mean, max) per Product:
          sum   mean  max
Product
A         900  300.0  500
B         500  250.0  300
C        1000  500.0  550

Applying Custom Functions:
You can also apply custom aggregation functions using .agg() or .apply().

Applying a custom function to calculate a range (max - min) for Sales per Product:

In [ ]:
sales_range = df.groupby('Product')['Sales'].agg(lambda x: x.max() - x.min())
print("\nRange of Sales per Product:")
print(sales_range)

Range of Sales per Product:
Product
A    350
B    100
C    100
Name: Sales, dtype: int64

Resetting the Index:
When performing aggregation, the grouped columns become the index. If you want to convert them back into regular columns, you can use .reset_index().

In [ ]:
reset_grouped_product_sales = grouped_product_sales.reset_index()
print("\nReset Index for Grouped Product Sales:")
print(reset_grouped_product_sales)

Reset Index for Grouped Product Sales:
  Product  Sales
0       A    900
1       B    500
2       C   1000

Filtering Data After Aggregation:
You can also filter the results after performing aggregation. For example, let's filter out products where the total sales are less than 500.

In [ ]:
filtered_sales = grouped_product_sales[grouped_product_sales > 500]
print("\nProducts with Total Sales Greater than 500:")
print(filtered_sales)

Products with Total Sales Greater than 500:
Product
A     900
C    1000
Name: Sales, dtype: int64

1.5 Data Merging and Joining

In [ ]:
import pandas as pd

In [ ]:
# Creating the first DataFrame (df1)
data1 = {
    'Employee_ID': [1, 2, 3, 4],
    'Name': ['John', 'Alice', 'Bob', 'Charlie'],
    'Department': ['HR', 'Finance', 'Engineering', 'Marketing']
}
df1 = pd.DataFrame(data1)

# Creating the second DataFrame (df2)
data2 = {
    'Employee_ID': [1, 2, 5, 6],
    'Salary': [50000, 60000, 45000, 70000]
}
df2 = pd.DataFrame(data2)

print("DataFrame 1:")
print(df1)

print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   Employee_ID     Name   Department
0            1     John           HR
1            2    Alice      Finance
2            3      Bob  Engineering
3            4  Charlie    Marketing

DataFrame 2:
   Employee_ID  Salary
0            1   50000
1            2   60000
2            5   45000
3            6   70000

Merging DataFrames
The merge() function is used to combine DataFrames on a common column (or index). It works similarly to SQL joins.

1. Inner Join (Default Merge)
By default, .merge() performs an inner join, meaning it only includes rows with matching values in both DataFrames.

In [ ]:
merged_df_inner = pd.merge(df1, df2, on='Employee_ID', how='inner')
print("\nInner Join (Merged DataFrame):")
print(merged_df_inner)

Inner Join (Merged DataFrame):
   Employee_ID   Name Department  Salary
0            1   John         HR   50000
1            2  Alice    Finance   60000

Left Join
In a left join, all rows from the left DataFrame (df1) are included, along with matching rows from the right DataFrame (df2). If there is no match, NaN will be used.

In [ ]:
merged_df_left = pd.merge(df1, df2, on='Employee_ID', how='left')
print("\nLeft Join (Merged DataFrame):")
print(merged_df_left)

Left Join (Merged DataFrame):
   Employee_ID     Name   Department   Salary
0            1     John           HR  50000.0
1            2    Alice      Finance  60000.0
2            3      Bob  Engineering      NaN
3            4  Charlie    Marketing      NaN

Right Join
A right join is similar to the left join, but it keeps all rows from the right DataFrame (df2) and adds matching rows from the left DataFrame (df1).

python
Copy

In [ ]:
merged_df_right = pd.merge(df1, df2, on='Employee_ID', how='right')
print("\nRight Join (Merged DataFrame):")
print(merged_df_right)

Right Join (Merged DataFrame):
   Employee_ID   Name Department  Salary
0            1   John         HR   50000
1            2  Alice    Finance   60000
2            5    NaN        NaN   45000
3            6    NaN        NaN   70000

 Outer Join
An outer join includes all rows from both DataFrames. Where there is no match, NaN will be inserted.

In [ ]:
merged_df_outer = pd.merge(df1, df2, on='Employee_ID', how='outer')
print("\nOuter Join (Merged DataFrame):")
print(merged_df_outer)

Outer Join (Merged DataFrame):
   Employee_ID     Name   Department   Salary
0            1     John           HR  50000.0
1            2    Alice      Finance  60000.0
2            3      Bob  Engineering      NaN
3            4  Charlie    Marketing      NaN
4            5      NaN          NaN  45000.0
5            6      NaN          NaN  70000.0

Merge on Multiple Columns
If the columns to merge on are not the same in both DataFrames, you can specify different column names using the left_on and right_on parameters.

In [ ]:
# Create a new DataFrame for this example
data3 = {
    'Department': ['HR', 'Finance', 'Engineering', 'Marketing'],
    'Manager': ['Tom', 'Jerry', 'David', 'Sophie']
}
df3 = pd.DataFrame(data3)

# Merge df1 and df3 on the 'Department' column
merged_df_multiple = pd.merge(df1, df3, on='Department', how='inner')
print("\nMerge on Multiple Columns (Department):")
print(merged_df_multiple)

Merge on Multiple Columns (Department):
   Employee_ID     Name   Department Manager
0            1     John           HR     Tom
1            2    Alice      Finance   Jerry
2            3      Bob  Engineering   David
3            4  Charlie    Marketing  Sophie

Joining DataFrames

The join() function is another way to merge DataFrames. It is mainly used to join on the index or columns when the index of one DataFrame is aligned with the index of the other DataFrame.

1. Simple Join
You can join two DataFrames based on the index. Here's an example:

In [ ]:
# Set 'Employee_ID' as the index for df1
df1.set_index('Employee_ID', inplace=True)

# Set 'Employee_ID' as the index for df2
df2.set_index('Employee_ID', inplace=True)

# Perform the join on index
joined_df = df1.join(df2, how='inner')
print("\nJoin DataFrames on Index:")
print(joined_df)

Join DataFrames on Index:
              Name Department  Salary
Employee_ID
1             John         HR   50000
2            Alice    Finance   60000

Left Join Using join()

You can also specify the type of join (left, right, etc.) when using the .join() method.

In [ ]:
# Left join on index
joined_df_left = df1.join(df2, how='left')
print("\nLeft Join Using join() Method:")
print(joined_df_left)

Left Join Using join() Method:
                Name   Department   Salary
Employee_ID
1               John           HR  50000.0
2              Alice      Finance  60000.0
3                Bob  Engineering      NaN
4            Charlie    Marketing      NaN

Join with Multiple Columns

If you need to join on multiple columns, you can reset the index and then use .join().

In [ ]:
# Reset the index to join on columns (if needed)
df1_reset = df1.reset_index()
df2_reset = df2.reset_index()

# Perform a join on a column (Employee_ID)
joined_df_multiple = df1_reset.join(df2_reset.set_index('Employee_ID'), on='Employee_ID', how='inner')
print("\nJoin on Multiple Columns (Employee_ID):")
print(joined_df_multiple)

Join on Multiple Columns (Employee_ID):
   Employee_ID   Name Department  Salary
0            1   John         HR   50000
1            2  Alice    Finance   60000

Filtering and Sorting

In [ ]:
import pandas as pd

In [ ]:
# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [50000, 60000, 55000, 70000, 52000]
}

df = pd.DataFrame(data)

In [ ]:
# Filtering: Select rows where Age is greater than 30
filtered_df = df[df['Age'] > 30]

# Sorting: Sort the filtered data by Salary in descending order
sorted_df = filtered_df.sort_values(by='Salary', ascending=False)

# Display the original, filtered, and sorted DataFrames
print("Original DataFrame:")
print(df)
print("\nFiltered DataFrame (Age > 30):")
print(filtered_df)
print("\nSorted DataFrame (by Salary, descending):")
print(sorted_df)

Original DataFrame:
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   55000
3    David   40      Houston   70000
4      Eva   28      Phoenix   52000

Filtered DataFrame (Age > 30):
      Name  Age     City  Salary
2  Charlie   35  Chicago   55000
3    David   40  Houston   70000

Sorted DataFrame (by Salary, descending):
      Name  Age     City  Salary
3    David   40  Houston   70000
2  Charlie   35  Chicago   55000

Handling CSV and Excel files

In [ ]:
import pandas as pd

In [ ]:
data = {
    'Product': ['A', 'B', 'A', 'B', 'C', 'A', 'C'],
    'Region': ['East', 'West', 'East', 'West', 'East', 'West', 'East'],
    'Salesperson': ['John', 'Paul', 'John', 'Paul', 'George', 'Ringo', 'George'],
    'Sales': [250, 300, 150, 200, 450, 500, 550]
}

df = pd.DataFrame(data)

In [ ]:
# Reading a CSV file
csv_file_path = 'sample_data.csv'  # Replace with your CSV file path
csv_data = pd.read_csv(csv_file_path)
print(csv_data.iloc[:5,:4])

   Index      Customer Id First Name Last Name
0      1  DD37Cf93aecA6Dc     Sheryl    Baxter
1      2  1Ef7b82A4CAAD10    Preston    Lozano
2      3  6F94879bDAfE5a6        Roy     Berry
3      4  5Cef8BFA16c5e3c      Linda     Olsen
4      5  053d585Ab6b3159     Joanna    Bender

In [ ]:
excel_file_path = 'excel_sample.xls'  # Replace with your CSV file path
excel_data = pd.read_excel(excel_file_path)
print(excel_data.iloc[:5,:4])

   0 First Name  Last Name  Gender
0  1      Dulce      Abril  Female
1  2       Mara  Hashimoto  Female
2  3     Philip       Gent    Male
3  4   Kathleen     Hanner  Female
4  5    Nereida    Magwood  Female

Advanced Data Manipulations

Work with pivot tables, multi-indexing, and reshaping.

In [ ]:
#Create a Pivot Table
print(pd.pivot_table(df,values="Salary",index="Age",aggfunc="max"))

     Salary
Age
25    50000
28    52000
30    60000
35    55000
40    70000

In [ ]:
#Create a Multi-Index DataFrame
de=pd.DataFrame([x for x in "ABCDEF"],index=[1,1,1,2,2,3])
print(de)

   0
1  A
1  B
1  C
2  D
2  E
3  F

In [ ]:
#Accessing Data in a Multi-Index DataFrame
print(de.loc[1])

   0
1  A
1  B
1  C

In [ ]:
#Using melt() to Unpivot Data
melted=pd.melt(df, id_vars=["Name", "City"], value_vars=["Salary", "Age"], var_name="Metric", value_name="Value")
print(melted)

      Name         City  Metric  Value
0    Alice     New York  Salary  50000
1      Bob  Los Angeles  Salary  60000
2  Charlie      Chicago  Salary  55000
3    David      Houston  Salary  70000
4      Eva      Phoenix  Salary  52000
5    Alice     New York     Age     25
6      Bob  Los Angeles     Age     30
7  Charlie      Chicago     Age     35
8    David      Houston     Age     40
9      Eva      Phoenix     Age     28